x1 = int(input())               # координати, е да обърнем внимание на реда
y1 = int(input())
x2 = int(input())
y2 = int(input())
x3 = int(input())
y3 = int(input())

a = abs(x2 - x3)
b = abs(y2 - y1)        # Гарантирано е, че y2 = y3.

# Трябва да пресметнем страната и височината на триъгълника. От картинките,
# както и от условието y2 = y3 забелязваме, че едната страна винаги е успоредна
# на хоризонталната ос. Това означава, че нейната дължина е равна на дължината
# на отсечката между нейните координати x2 и x3, която е равна на разликата
# между по-голямата и по-малката координата. Аналогично можем да изчислим и
# височината. Тя винаги ще е равна на разликата между y1 и y2 (или y3, тъй като са
# равни). Тъй като не знаем дали винаги x2 ще е по-голям от x3, или y1 ще е под
# или над страната на триъгълника, ще използваме абсолютните стойности на
# разликата, за да получаваме винаги положителни числа, понеже една отсечка не
# може да има отрицателна дължина

area = (a * b) / 2
print(area)